app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('Sherman', 'sherman@e19.ca', '2011-03-22 09:13:38.156101', '2011-03-22 09:13:38.156101', '9b9616e1f9d7f3b82fe3c09216abe497545099a87be5e63cf00c72ebb747f002', '91b5a1ef3b9af615dbc39b8521b832806bb9d0cc6035c124a9cccc1252b9da1d')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "name" = 'sftsang', "encrypted_password" = 'a93f977f60ca7696e1a6bc587c12a87fbca0583636f6313c34e62f6d9b35fde1', "updated_at" = '2011-03-23 21:49:40.011585' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 7
---
  def destroy
    user = User.find(params[:id])
    if (!user.admin? && user != current_user)
      user.destroy